sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
							if (cml_ptr < cml_limit){
								cml_ptr++;
								HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 3, 2);
							}

							break;

						//-----------------------------------------------------
						// Left
						case 'D':
							if (cml_ptr > cml_head){
								cml_ptr--;
								HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 3, 2);
							}
							break;

						//-----------------------------------------------------
						default:
							break;

						}
					}
				}
			}
		}
		//else /*if(u3_states == HAL_TIMEOUT)*/{
			//HAL_UART_Abort(&huart3);
		//}


		osMutexRelease(MUTEX_DebugHandle);
#else

		//HAL_DMA_Abort(&hdma_usart3_tx);
		//HAL_DMA_Abort(&hdma_usart3_rx);

		//HAL_Delay(1);
		osMutexWait(MUTEX_DebugHandle, osWaitForever);
		cnt = 0;
		if(HAL_UART_Receive_DMA(&huart3, &recv3[cnt], 1) == HAL_OK){
			cnt++;
			//HAL_Delay(1);
			while(HAL_UART_Receive_DMA(&huart3, &recv3[cnt], 1) == HAL_OK){
				cnt++;
				if(cnt > 3) break;
			}

			osDelay(1);
			//HAL_Delay(2);
			// Abort UART processing.

		}
		//HAL_UART_Abort_IT(&huart3);




		//}
		/*if (cnt > 0){
			HAL_UART_Transmit_DMA(&huart3, &recv3[0], cnt);
		}*/

		if(cnt == 3){
			if (recv3[0] == '\e'){
				//temp = recv3[0];
				//recv3[0] = '\e';
				//recv3[1] = '[';
				//recv3[2] = (uint8_t)temp;
				switch(recv3[2]){
				//-----------------------------------------------------
				// Up
				case 'A':
					//recv3[1] = 0x48;
					break;

				//-----------------------------------------------------
				// Down
				case 'B':
					//recv3[1] = 0x50;
					break;

				//-----------------------------------------------------
				// Right
				case 'C':
					//recv3[1] = 0x4D;

					if (cml_ptr < cml_limit){
						cml_ptr++;
						HAL_UART_Transmit_DMA(&huart3, recv3, 3);
					}

					break;

				//-----------------------------------------------------
				// Left
				case 'D':
					if (cml_ptr > cml_head){
						cml_ptr--;
						HAL_UART_Transmit_DMA(&huart3, recv3, 3);
					}
					break;

				//-----------------------------------------------------
				default:
					break;

				}
			}
		}
		else if(cnt == 1){
			switch(recv3[0]){
			case '\0':
				break;
			//-----------------------------------------------------
			case '\r':
			case '\n':
				HAL_UART_Transmit_DMA(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1);
				*cml_limit = '\0';
				//osMutexRelease(MUTEX_DebugHandle);
				//aewin_dbg("\n\rCommands Length = %d",(uint32_t)(cml_limit - cml_head));
				osMutexWait(MUTEX_CMD_PROCHandle, osWaitForever);
				memcpy(cml_proc, cml_array, (uint32_t)(cml_limit - cml_head + 1));
				osMutexRelease(MUTEX_CMD_PROCHandle);
				cml_ptr = cml_limit = cml_head;

				break;

			//-----------------------------------------------------
			/* Delete Key. */
			case 0x7E:

				break;
			//-----------------------------------------------------
			case 0x7F:
				recv3[0] = '\b';

			case '\b':
				if ((cml_ptr > cml_head) && (cml_limit > cml_head)){
					temp = cml_limit - cml_ptr;
					*(--cml_ptr) = 0;
					strncpy(cml_ptr, (cml_ptr + 1), temp);
					HAL_Delay(1);
					HAL_UART_Transmit_DMA(&huart3, recv3, 1);
					HAL_Delay(2);
					HAL_UART_Transmit_DMA(&huart3, cml_ptr, temp);
					HAL_Delay(2);
					HAL_UART_Transmit_DMA(&huart3, " ", 1);
					//HAL_UART_Transmit_DMA(&huart3, (uint8_t*)&recv3[0], 1, UART3_TIMEOUT);


					for(temp = 0; temp < cml_limit - cml_ptr; temp++){
						HAL_Delay(1);
						HAL_UART_Transmit_DMA(&huart3, recv3, 1);
					}
					*(--cml_limit) = 0;
				}

				//HAL_UART_Transmit_DMA(&huart3, " ", 1, 10);
				//HAL_UART_Transmit_DMA(&huart3, (uint8_t*)&recv3[0], 1, 1);
				break;

			//-----------------------------------------------------
			case '\e':
				break;

			//-----------------------------------------------------
			default:
				if (cml_ptr >= cml_head + MAX_CML_CHAR - 1){
					break;
				}
				*(cml_ptr++) = recv3[0];
				if (cml_ptr > cml_limit) cml_limit = cml_ptr;
				HAL_UART_Transmit_DMA(&huart3, recv3, 1);
				break;
			}
		}


		memset(recv3, 0, 4);
		osMutexRelease(MUTEX_DebugHandle);

#endif
		osDelay(UART3_TASK_ENTRY_TIME);
	}

  /* USER CODE END usart3_entry */
}

/* ignition_entry function */
void ignition_entry(void const * argument)
{
  /* USER CODE BEGIN ignition_entry */
	osEvent  	evt;
	uint32_t 	adc_24v, adc_temp;

	ig_event = gIG_Event;
    /* Infinite loop */
    for(;;)
    {

		//HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
		//HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
		//aewin_dbg("\n\rMUC Time: %2d:%2d:%2d",sTime.Hours ,sTime.Minutes, sTime.Seconds);
		//aewin_dbg("\n\rMUC Date: 20%2d_%2d_%2d  Weekday:%d",sDate.Year ,sDate.Month, sDate.Date ,sDate.WeekDay);

    	/** Get ADC 24V from Q. */
    	evt = osMessageGet(ADC_VOLT_QHandle, osWaitForever);
		if (evt.status == osEventMessage){
			adc_24v = evt.value.v;
			//aewin_dbg("\n\r");
			//aewin_dbg("\n\rGet ADC 24V = %.1d.%.2d V", (((adc_24v & 0xfffU) * 330) / 409600), \
							  	  	  	  	  	  	   ((((adc_24v & 0xfffU) * 330) / 4096) % 100));
		}

		/** Get the ADC value of MCU temperature. */
		evt = osMessageGet(ADC_TEMP_QHandle, osWaitForever);
		if (evt.status == osEventMessage){
			adc_temp = evt.value.v;
			//aewin_dbg("\n\r");
			//aewin_dbg("\n\rGet ADC TEMP = %.1d.%.2d V", (((adc_temp & 0xfffU) * 330) / 409600), \
													  ((((adc_temp & 0xfffU) * 330) / 4096) % 100));
		}


		switch(ig_event.IG_States){
			case IG_Recovery:
				// Recovery all of IG states and paremeters.
				ig_event = gIG_Event;
				ig_event.IG_States = IG_CloseUp;
				break;

			//-------------------------------------------------------------------------------------
			case IG_CloseUp:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					/* IG On process */
					// Ready to enter IG_PowerOn_Delay state.
					ig_event.IG_States = IG_PowerOn_Delay;
					// Reset the "Start up timeout"
					ig_event.startup_timeout = gIG_Event.startup_timeout;
					aewin_dbg("\n\rIgnition ON! IG_CloseUp --> IG_PowerOn_Delay");
				}

				// Judge the power button states.
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					ig_event.startup_timeout = gIG_Event.startup_timeout;
					ig_event.IG_States = IG_Wait_StartUp;
					aewin_dbg("\n\rPower button On! IG_CloseUp --> IG_Wait_StartUp");
				}
				break;

