sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
			//-------------------------------------------------------------------------------------
			case IG_PowerOn_Delay:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					if (0 == (ig_event.pwron_delay--)){
						ig_event.pwron_delay = gIG_Event.pwron_delay;
						ig_event.IG_States = IG_Wait_StartUp;
						aewin_dbg("\n\rPower on delay pass! IG_PowerOn_Delay --> IG_Wait_StartUp");
					}
				}
				else{
					ig_event.pwron_delay = gIG_Event.pwron_delay;
					ig_event.IG_States = IG_CloseUp;
					aewin_dbg("\n\rPower on delay failed! IG_PowerOn_Delay --> IG_CloseUp");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Wait_StartUp:
				/* Power button has been (long) pressed. */
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					ig_event.pwrbtn_pressed = TRUE;
					if(0 == (ig_event.pwroff_btn_cnt--)){
						ig_event.IG_States = IG_Recovery;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_Recovery");
					}
				}

				if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					ig_event.pwrbtn_pressed = FALSE;
				}

				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					if (0 == (ig_event.wait_startup_time--)){
						ig_event.wait_startup_time = gIG_Event.wait_startup_time;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);
						// Confirm the the DC2DC power and system power are available.
						while((sva_gpi.dc2dc_pwrok != GPIO_PIN_SET) || (sva_gpi.sys_pwron == GPIO_PIN_SET)){
							if(0 == (ig_event.pwrgood_chk_time--)){
								break;
							}
						}
						if(0 != ig_event.pwrgood_chk_time){
							ig_event.IG_States = IG_Start_Up;
							aewin_dbg("\n\rPower on delay ok! IG_Wait_StartUp --> IG_Start_Up");
						}
						else{
							HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
							ig_event.IG_States = IG_CloseUp;
							aewin_dbg("\n\rDE2DC Power on failed! IG_Wait_StartUp --> IG_CloseUp");
						}
						ig_event.pwrgood_chk_time = gIG_Event.pwrgood_chk_time;
					}
				}
				else{
					ig_event.wait_startup_time = gIG_Event.wait_startup_time;
					ig_event.IG_States = IG_PowerOn_Delay;
					aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_PowerOn_Delay");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Start_Up:
				if(ig_event.startup_timeout > 0){
					/* Lock ignition off to prevent that user shutdowns the OS. */
					ig_event.startup_timeout--;
					aewin_dbg("\n\rLock power on!");
				}
				else{
					if( sva_gpi.ig_sw ==  GPIO_PIN_RESET){
						ig_event.IG_States = IG_Shutdown_Delay;
						aewin_dbg("\n\rIngition switch off! IG_Start_Up --> IG_Shutdown_Delay");
					}
				}

				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					ig_event.pwrbtn_pressed = TRUE;
					if(0 == (ig_event.pwroff_btn_cnt--)){
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						ig_event.IG_States = IG_Recovery;
					}
				}

				if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					ig_event.pwrbtn_pressed = FALSE;
					ig_event.IG_States = IG_shutting_Down;
					aewin_dbg("\n\rPower button off! IG_Start_Up --> IG_shutting_Down");
				}

				break;

			//-------------------------------------------------------------------------------------
			case IG_Shutdown_Delay:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					if (0 == (ig_event.pwroff_delay--)){
						ig_event.IG_States = IG_shutting_Down;
						ig_event.pwroff_delay = gIG_Event.pwroff_delay;
						aewin_dbg("\n\rPower off delay pass! IG_Shutdown_Delay --> IG_shutting_Down");
					}
				}
				else{
					ig_event.IG_States = IG_Start_Up;
					ig_event.pwroff_delay = gIG_Event.pwroff_delay;
					aewin_dbg("\n\rPower off delay failed! IG_Shutdown_Delay --> IG_Start_Up");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_shutting_Down:
				if(sva_gpi.ig_sw == GPIO_PIN_RESET){
					if (0 == (ig_event.shutdown_delay--)){
						ig_event.IG_States = IG_CloseUp;
						ig_event.shutdown_delay = gIG_Event.shutdown_delay;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						aewin_dbg("\n\rShutdown delay pass! IG_shutting_Down --> IG_CloseUp");
					}
				}
				else{
					ig_event.IG_States = IG_Shutdown_Delay;
					ig_event.shutdown_delay = gIG_Event.shutdown_delay;
					aewin_dbg("\n\rShutdown delay failed! IG_shutting_Down --> IG_Shutdown_Delay");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_LowPower_Delay:
				break;

		}
    	osDelay(INGITION_TASK_ENTRY_TIME);
    }
  /* USER CODE END ignition_entry */
}

/* i2c1_entry function */
void i2c1_entry(void const * argument)
{
  /* USER CODE BEGIN i2c1_entry */

	//I2C_HandleTypeDef I2cHandle;
	/* Buffer used for reception */
	uint8_t ADXL345_RxBuffer[6];
	uint8_t ADXL345_DEVID[1];
	uint8_t ASXL345_sensorSetting[1];
	//uint8_t regptr = I2C_MEM_ADDRESS_ADXL345;
	uint8_t regptr[] = {I2C_ADXL345_CMD_DEV_ID, I2C_ADXL345_CMD_PWR_CTL, I2C_ADXL345_DATA_MEASURE, I2C_ADXL345_CMD_GPS_DATA};

	//read ADXL345 device ID (0xE5)
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[0], 1, 1000);
	//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_DEVID, 1, 10000);

	//enable ADXL345 x,y,z-axis G-sensor
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[1], 2, 1000);

	//Check G-sensor setting
	//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, &regptr[1], 1, 1000);
	//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ASXL345_sensorSetting, 1, 10000);

    /* Infinite loop */
	for(;;)
	{
		//HAL_SMBUS_Master_Transmit_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345, &regptr, 1, SMBUS_AUTOEND_MODE);
		//HAL_Delay(10);
		//HAL_SMBUS_Master_Receive_IT(&hsmbus1, I2C_DEV_ADDRESS_ADXL345,  ADXL345_RxBuffer, 6, SMBUS_AUTOEND_MODE);

		//HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);
		if((sva_gpi.dc2dc_pwrok == GPIO_PIN_SET) && (sva_gpi.sys_pwron == GPIO_PIN_SET)){
			//HAL_I2C_Master_Transmit(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t*)regptr, sizeof(regptr), 1000);
			//HAL_I2C_Master_Receive(&hi2c1, I2C_ADXL345_DEV_ADDRESS, (uint8_t *)ADXL345_DEVID, 1, 10000);

